{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}I:\Speed\ReplicationFiles\LogFiles/Tab3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Nov 2019, 17:56:07
{txt}
{com}. 
. use Data/BaseSamp.dta, replace
{txt}
{com}. 
. 
. /*********************************************************************/
. /*** I. Sample and additional variables                                                    ***/
. /*********************************************************************/
.         /* Treat X Post */
. gen TP = treat * (wk2open >= 0)
{txt}
{com}. gen post = (wk2open >= 0)
{txt}
{com}. 
. /*********************************************************************/
. /*** II. Regressions                                                                                       ***/
. /***
>         Col 1: stacked DID
>         Col 2: twoway FEs with treated only
>         Col 3: twoway FEs with treated only, adj. for differential seasonality
> ***/
. /*********************************************************************/
. eststo clear
{txt}
{com}. 
. /*** Col 1 ***/
. # delimit ;
{txt}delimiter now ;
{com}. reghdfe lnspd_res
>         TP treat
>         if inrange(wk2open,-6,47)
>         , a(linkid case_wk2open yrwk##c.(lnpop lngdppc)) cluster(case)
> ;
{res}{txt}note: treat is probably collinear with the fixed effects (all values close to zero after partialling-out; tol = 1.0e-09)
{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 67 iterations)
{res}{txt}note: treat omitted because of collinearity
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   642,453
{txt}Absorbing 3 HDFE groups{col 51}F({res}   1{txt},{res}     44{txt}){col 67}= {res}     29.98
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.2257
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1980
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0022
{txt}{col 1}Number of clusters ({res}case{txt}) {col 30}= {res}        45{txt}{col 51}Root MSE{col 67}= {res}    0.1287

{txt}{ralign 78:(Std. Err. adjusted for {res:45} clusters in case)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnspd_res{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}TP {c |}{col 14}{res}{space 2} .0436672{col 26}{space 2} .0079746{col 37}{space 1}    5.48{col 46}{space 3}0.000{col 54}{space 4} .0275954{col 67}{space 3} .0597389
{txt}{space 7}treat {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}-.0111793{col 26}{space 2} .0029958{col 37}{space 1}   -3.73{col 46}{space 3}0.001{col 54}{space 4}-.0172169{col 67}{space 3}-.0051417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 16}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}    Absorbed FE{col 17}{c |} Categories{col 30} - Redundant{col 42}  = Num. Coefs{col 57}{c |}
{col 1}{text}{hline 16}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}         linkid{col 17}{c |}{space 1}    20430{col 30}{space 1}        0{col 42}{result}{space 1}    20430{col 56}{text} {col 57}{c |}
{col 1}{text}   case_wk2open{col 17}{c |}{space 1}     1562{col 30}{space 1}     1562{col 42}{result}{space 1}        0{col 56}{text}*{col 57}{c |}
{col 1}{text}           yrwk{col 17}{c |}{space 1}       72{col 30}{space 1}        1{col 42}{result}{space 1}       71{col 56}{text} {col 57}{c |}
{col 1}{text}   yrwk#c.lnpop{col 17}{c |}{space 1}       72{col 30}{space 1}        0{col 42}{result}{space 1}       72{col 56}{text}?{col 57}{c |}
{col 1}{text} yrwk#c.lngdppc{col 17}{c |}{space 1}       72{col 30}{space 1}        0{col 42}{result}{space 1}       72{col 56}{text}?{col 57}{c |}
{col 1}{text}{hline 16}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation

{com}. # delimit cr
{txt}delimiter now cr
{com}. eststo Col1
{txt}
{com}. 
. /*** Col 2 ***/
. # delimit ;
{txt}delimiter now ;
{com}. reghdfe lnspd_res
>         TP
>         if treat == 1 & inrange(wk2open,-6,47)
>         , a(linkid yrwk) cluster(case)
> ;
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 8 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   284,301
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     43{txt}){col 67}= {res}     17.14
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0002
{txt}{col 51}R-squared{col 67}= {res}    0.2089
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1847
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0051
{txt}{col 1}Number of clusters ({res}case{txt}) {col 30}= {res}        44{txt}{col 51}Root MSE{col 67}= {res}    0.1332

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in case)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnspd_res{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}TP {c |}{col 14}{res}{space 2} .0360287{col 26}{space 2}  .008703{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .0184775{col 67}{space 3} .0535798
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0206945{col 26}{space 2} .0074214{col 37}{space 1}   -2.79{col 46}{space 3}0.008{col 54}{space 4}-.0356613{col 67}{space 3}-.0057278
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}      linkid{col 14}{c |}{space 1}     8342{col 27}{space 1}        0{col 39}{result}{space 1}     8342{col 53}{text} {col 54}{c |}
{col 1}{text}        yrwk{col 14}{c |}{space 1}       72{col 27}{space 1}        1{col 39}{result}{space 1}       71{col 53}{text} {col 54}{c |}
{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}

{com}. # delimit cr
{txt}delimiter now cr
{com}. eststo Col2
{txt}
{com}. 
. /*** Col 3 ***/
. # delimit ;
{txt}delimiter now ;
{com}. reghdfe lnspd_res
>         TP
>         if treat == 1 & inrange(wk2open,-6,47)
>         , a(linkid yrwk yrwk##c.(lnpop lngdppc)) cluster(case)
> ;
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 12 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}   284,301
{txt}Absorbing 3 HDFE groups{col 51}F({res}   1{txt},{res}     43{txt}){col 67}= {res}     13.21
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0007
{txt}{col 51}R-squared{col 67}= {res}    0.2179
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1936
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0043
{txt}{col 1}Number of clusters ({res}case{txt}) {col 30}= {res}        44{txt}{col 51}Root MSE{col 67}= {res}    0.1325

{txt}{ralign 78:(Std. Err. adjusted for {res:44} clusters in case)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnspd_res{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}TP {c |}{col 14}{res}{space 2}  .035916{col 26}{space 2} .0098829{col 37}{space 1}    3.63{col 46}{space 3}0.001{col 54}{space 4} .0159853{col 67}{space 3} .0558467
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0205989{col 26}{space 2} .0084085{col 37}{space 1}   -2.45{col 46}{space 3}0.018{col 54}{space 4}-.0375562{col 67}{space 3}-.0036416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{col 1}{text}{hline 16}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}    Absorbed FE{col 17}{c |} Categories{col 30} - Redundant{col 42}  = Num. Coefs{col 57}{c |}
{col 1}{text}{hline 16}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}         linkid{col 17}{c |}{space 1}     8342{col 30}{space 1}        0{col 42}{result}{space 1}     8342{col 56}{text} {col 57}{c |}
{col 1}{text}           yrwk{col 17}{c |}{space 1}       72{col 30}{space 1}        1{col 42}{result}{space 1}       71{col 56}{text} {col 57}{c |}
{col 1}{text}           yrwk{col 17}{c |}{space 1}       72{col 30}{space 1}       72{col 42}{result}{space 1}        0{col 56}{text}?{col 57}{c |}
{col 1}{text}   yrwk#c.lnpop{col 17}{c |}{space 1}       72{col 30}{space 1}        0{col 42}{result}{space 1}       72{col 56}{text}?{col 57}{c |}
{col 1}{text} yrwk#c.lngdppc{col 17}{c |}{space 1}       72{col 30}{space 1}        0{col 42}{result}{space 1}       72{col 56}{text}?{col 57}{c |}
{col 1}{text}{hline 16}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
? = number of redundant parameters may be higher

{com}. # delimit cr
{txt}delimiter now cr
{com}. eststo Col3
{txt}
{com}. 
. /*********************************************************************/
. /*** III. Display and save tables                                                                  ***/
. /*********************************************************************/
. /*** Display ***/
. # delimit ;
{txt}delimiter now ;
{com}. esttab Col*
>         , keep(TP)
>         se(3) b(3)
>         star(* 0.1 ** 0.05 *** 0.01)
>         title("Table 3")
>         mtitle(stack twoway-treatonly-noseason twoway-treatonly)
> ;
{res}
{txt}Table 3
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                    stack    twoway-tre~n    twoway-tre~y   
{txt}{hline 60}
{txt}TP          {res}        0.044***        0.036***        0.036***{txt}
            {res} {ralign 12:{txt:(}0.008{txt:)}}    {ralign 12:{txt:(}0.009{txt:)}}    {ralign 12:{txt:(}0.010{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}       642453          284301          284301   {txt}
{txt}{hline 60}
{txt}Standard errors in parentheses
{txt}* p<0.1, ** p<0.05, *** p<0.01

{com}. # delimit cr
{txt}delimiter now cr
{com}. 
. /*** Save ***/
. # delimit ;
{txt}delimiter now ;
{com}. esttab Col* using "TablesFigures/Tab3.tex"
>         , replace
>         keep(TP)
>         se(3) b(3)
>         star(* 0.1 ** 0.05 *** 0.01)
>         title("Table 3")
>         mtitle(stack stack-season twoway-treatonly twoway)
> ;
{res}{txt}(output written to {browse  `"TablesFigures/Tab3.tex"'})

{com}. # delimit cr
{txt}delimiter now cr
{com}. 
. * end
. timer off 1
{txt}
{com}. timer list 1
{res}   1:     34.64 /        1 =      34.6390
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}